tutorial/mooringCase3D/mooredFloatingObject/system/beamtwo/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "DWDTheta|WTheta"
    {
        solver Eigen;
        tolerance 1e-10;
        relTol 0;
        minIter 1;
        maxIter 1;
    };
}

relaxationFactors
{
    euqations
    {
        // U 0.99;
    }
    fields
    {
        // DW 0.5;
      
        // DTheta 0.1;
        // DLambda 0.1;
        
        // Theta 0.5;
        // Lambda 0.5;
        
        // stretchRatio 0.5;
    }
}


// ************************************************************************* //
