tutorial/mooringCase3D/mooredFloatingObject/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs
(
    libfiniteVolumeBeamMooring.so
    libsixDoFRigidBodyStateFvBeam.so
	libmyScotchDecomp.so
	libwireBunchingModels.so
);


application     interFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         16;

deltaT          0.001;

writeControl    adjustableRunTime; // timeStep; //

writeInterval   0.2;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression on;

timeFormat      general;

timePrecision   6;

runTimeModifiable no;

adjustTimeStep  yes;

maxCo           0.5;
maxAlphaCo      0.5;
maxDeltaT       0.01;

functions
{
    sixDoF_History
    {
        type           sixDoFRigidBodyStateFvBeam;
        libs           ("libsixDoFRigidBodyStateFvBeam.so");
        angleFormat    radians;//radians, degrees

        writeControl   writeTime;
        //writeInterval  5;
    }

    interfaceHeight1
    {
        type            interfaceHeight;

        libs            ("libfieldFunctionObjects.so");

        locations       ((-2.74 0 0) (-0.05 0 0) (0.07 0 0) (0.55 0 0) (1.9 0 0) (2.9 0 0));
        alpha           alpha.water;

        writeControl   timeStep;
        writeInterval  5;
    }
}

// ************************************************************************* //
